### import libraries

In [1]:
import pandas as pd
import numpy as np

### load datasets

In [2]:
date = pd.read_csv("data/dates.csv")
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [3]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [4]:
time = pd.read_csv("data/messages.csv")
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [5]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

### working with dates

In [6]:
#convert to datetime field
date["date"] = pd.to_datetime(date["date"])
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

In [7]:
# extract year
date["year"] = date["date"].dt.year

# extract month
date["month"] = date["date"].dt.month

date["month_name"] = date["date"].dt.month_name()

# extract days
date["day"] = date["date"].dt.day

# day of week
date["day_of_week"] = date["date"].dt.dayofweek

# day of week name
date["day_of_week_name"] = date["date"].dt.day_name()

# is weekend?
date['is_weekend'] = np.where(date['day_of_week_name'].isin(['Sunday', 'Saturday']), 1,0)

# week of the year
date['date_week'] = date['date'].dt.isocalendar().week

# quarter of the year
date['quarter'] = date['date'].dt.quarter

# semester of the year
date['semester'] = np.where(date['quarter'].isin([1,2]), 1, 2)

date.head()

,date,product_id,city_id,orders,year,month,month_name,day,day_of_week,day_of_week_name,is_weekend,date_week,quarter,semester
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday,0,50,4,2
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday,0,33,3,2
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday,0,43,4,2
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday,1,33,3,2
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday,1,1,1,1

### Extract Time elapsed between dates

In [8]:
import datetime

today = datetime.datetime.today()

today

datetime.datetime(2022, 8, 11, 8, 44, 22, 713322)

In [9]:
today - date['date']

0      975 days 08:44:22.713322
1     1457 days 08:44:22.713322
2     1388 days 08:44:22.713322
3     1090 days 08:44:22.713322
4     1313 days 08:44:22.713322
                 ...
995   1403 days 08:44:22.713322
996   1344 days 08:44:22.713322
997   1192 days 08:44:22.713322
998   1257 days 08:44:22.713322
999   1031 days 08:44:22.713322
Name: date, Length: 1000, dtype: timedelta64[ns]

In [10]:
# days passed
(today - date['date']).dt.days

0       975
1      1457
2      1388
3      1090
4      1313
       ...
995    1403
996    1344
997    1192
998    1257
999    1031
Name: date, Length: 1000, dtype: int64

In [11]:
# Months passed
np.round((today -date['date']) / np.timedelta64(1, 'M'),0)

0      32.0
1      48.0
2      46.0
3      36.0
4      43.0
       ...
995    46.0
996    44.0
997    39.0
998    41.0
999    34.0
Name: date, Length: 1000, dtype: float64

### working with time

In [12]:
# Converting to datetime datatype
time['date'] = pd.to_datetime(time['date'])
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [13]:
time.head()

                 date                                                msg
0 2013-12-15 00:50:00                           ищу на сегодня мужика 37
1 2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2 2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3 2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4 2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [14]:
# hour
time['hour'] = time['date'].dt.hour

# minute
time['min'] = time['date'].dt.minute

#second
time['sec'] = time['date'].dt.second

# extract time part
time['time'] = time['date'].dt.time

time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

### Extract time difference

In [15]:
today - time['date']

0     3161 days 07:54:22.713322
1     3025 days 09:04:22.713322
2     3511 days 08:23:22.713322
3     2813 days 08:13:22.713322
4     3210 days 09:33:22.713322
                 ...
995   3800 days 07:54:22.713322
996   3121 days 09:30:22.713322
997   3586 days 09:07:22.713322
998   3702 days 09:10:22.713322
999   2974 days 09:19:22.713322
Name: date, Length: 1000, dtype: timedelta64[ns]

In [16]:
# in seconds
(today - time['date'])/np.timedelta64(1,'s')

0      2.731389e+08
1      2.613927e+08
2      3.033806e+08
3      2.430728e+08
4      2.773784e+08
           ...
995    3.283485e+08
996    2.696886e+08
997    3.098632e+08
998    3.198858e+08
999    2.569872e+08
Name: date, Length: 1000, dtype: float64

In [17]:
# in minutes
(today - time['date'])/np.timedelta64(1,'m')

0      4.552314e+06
1      4.356544e+06
2      5.056343e+06
3      4.051213e+06
4      4.622973e+06
           ...
995    5.472474e+06
996    4.494810e+06
997    5.164387e+06
998    5.331430e+06
999    4.283119e+06
Name: date, Length: 1000, dtype: float64

In [18]:
# in hours
(today - time['date'])/np.timedelta64(1,'h')

0      75871.906309
1      72609.072976
2      84272.389643
3      67520.222976
4      77049.556309
           ...
995    91207.906309
996    74913.506309
997    86073.122976
998    88857.172976
999    71385.322976
Name: date, Length: 1000, dtype: float64